In [1]:
import numpy as np
import pandas as pd

Why missing data treatment is important ?
    influence accuracy of the model predictions
    Example : online survey, sensor problems
    NaN (Not a Number)

In [2]:
df = pd.DataFrame(np.random.randn(5,3), index=['a','c','e','f','h'],columns=['one','two','three'])
df = df.reindex(['a','b','c','d','e','f','g','h'])
df

        one       two     three
a -0.719535  0.253948  0.335152
b       NaN       NaN       NaN
c  0.938494 -1.377965  0.344504
d       NaN       NaN       NaN
e  0.277448 -0.486819  0.747845
f -0.566205  0.132364 -0.944325
g       NaN       NaN       NaN
h -0.056812 -0.017642  1.215338

In [3]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [4]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [5]:
df['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

notnull 與 notna 獲得相同結果

Calculations with Missing Data
    When summing data, NA will be treated as Zero
    If the data are all NA, then the result will be Zero

In [6]:
df['one'].sum()

-0.12660907091599743

In [7]:
pd_nan = pd.DataFrame(index=[0,1,2,3,4,5],columns=['one','two'])
pd_nan

   one  two
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN

In [8]:
pd_nan['one'].sum()

0

Clean / Fill Missing Data

Repalce NA with a scalar value

In [9]:
df = pd.DataFrame(np.random.randn(3, 3), index=['a','c','e'],columns=['one','two','three'])
df = df.reindex(['a','b','c'])
df

        one       two     three
a -0.906555 -0.021296  0.350308
b       NaN       NaN       NaN
c  1.071309 -0.752887  0.467306

In [10]:
df.fillna(0)

        one       two     three
a -0.906555 -0.021296  0.350308
b  0.000000  0.000000  0.000000
c  1.071309 -0.752887  0.467306

In [11]:
df.fillna(value=df.mean())
# Fill with the mean of each column

        one       two     three
a -0.906555 -0.021296  0.350308
b  0.082377 -0.387092  0.408807
c  1.071309 -0.752887  0.467306

Fill NA forward and backward

In [12]:
df = pd.DataFrame(np.random.randn(5,3),
                  index = ['a','c','e','f','h'],
                  columns = ['one','two','three']
                 )

df = df.reindex(['a','b','c','d','e','f','g','h'])
df

        one       two     three
a -0.682208 -0.656725  0.695038
b       NaN       NaN       NaN
c  0.202473 -0.864841  0.123412
d       NaN       NaN       NaN
e -0.292089 -1.795492  1.060900
f -3.162164  0.171679 -1.079133
g       NaN       NaN       NaN
h -0.822901  0.216307  0.129000

補上前一列數值 df.fillna(method='pad')

In [13]:
df.fillna(method='pad')

        one       two     three
a -0.682208 -0.656725  0.695038
b -0.682208 -0.656725  0.695038
c  0.202473 -0.864841  0.123412
d  0.202473 -0.864841  0.123412
e -0.292089 -1.795492  1.060900
f -3.162164  0.171679 -1.079133
g -3.162164  0.171679 -1.079133
h -0.822901  0.216307  0.129000

補上後一列數值 df.fillna(method='backfill')

In [14]:
df.fillna(method='backfill')

        one       two     three
a -0.682208 -0.656725  0.695038
b  0.202473 -0.864841  0.123412
c  0.202473 -0.864841  0.123412
d -0.292089 -1.795492  1.060900
e -0.292089 -1.795492  1.060900
f -3.162164  0.171679 -1.079133
g -0.822901  0.216307  0.129000
h -0.822901  0.216307  0.129000

Drop missing values
    By default, axis = 0
    ( if any value within a row is NA then the whole row is excluded )

In [15]:
df = pd.DataFrame(np.random.randn(5,3),
                  index = ['a','c','e','f','h'],
                  columns = ['one','two','three']
                 )

df = df.reindex(['a','b','c','d','e','f','g','h'])
df

        one       two     three
a -1.590258 -0.201733  0.786493
b       NaN       NaN       NaN
c -0.451441 -1.446256 -0.966253
d       NaN       NaN       NaN
e  0.599578 -1.618519 -0.791942
f -1.581768 -0.531655 -0.100964
g       NaN       NaN       NaN
h  1.403278  1.371647  0.451821

In [18]:
df.dropna()

        one       two     three
a -1.590258 -0.201733  0.786493
c -0.451441 -1.446256 -0.966253
e  0.599578 -1.618519 -0.791942
f -1.581768 -0.531655 -0.100964
h  1.403278  1.371647  0.451821

In [20]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]
                
                
                    })
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [22]:
df.dropna(axis=1) #刪除整行較少見

   C
0  1
1  2
2  3

In [27]:
df.dropna(thresh=1)  # Threshold 缺失值可容納的量

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Replace missing (or) generic values

In [28]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})
df

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [29]:
df.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [30]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]
                
                
                    })
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
df.replace({np.NAN:0,2:2.5})

     A    B    C
0  1.0  5.0  1.0
1  2.5  0.0  2.5
2  0.0  0.0  3.0